P17 (). Queremos saber cuáles son los negocios más sexys, para esto vamos a ver cuáles son los 3 el negocios con más tips que contengan el texto “sexy”

In [1]:
import pandas as pd

In [2]:
business = pd.read_csv("business.csv", usecols=["name", "business_id"])
business = business.dropna()
business.shape

(150346, 2)

In [3]:
tips = pd.read_csv("tip.csv", usecols=["business_id", "text"])
tips.shape

(908915, 2)

In [4]:
tips.dropna(inplace=True)
tips.shape

(908910, 2)

In [5]:
tips

,business_id,text
0,3uLgwr0qeCNMjKenHJwPGQ,Avengers time with the ladies.
1,QoezRbYQncpRqyrLH6Iqjg,They have lots of good deserts and tasty cuban...
2,MYoRNLb5chwjQe3c_k37Gg,It's open even when you think it isn't
3,hV-bABTK-glh5wj31ps_Jw,Very decent fried chicken
4,_uN0OudeJ3Zl_tf6nxg5ww,Appetizers.. platter special for lunch
...,...,...
908910,3lHTewuKFt5IImbXJoFeDQ,Disappointed in one of your managers.
908911,OaGf0Dp56ARhQwIDT90w_g,Great food and service.
908912,hYnMeAO77RGyTtIzUSKYzQ,Love their Cubans!!
908913,s2eyoTuJrcP7I_XyjdhUHQ,Great pizza great price
908914,_cb1Vg1NIWry8UA0jyuXnQ,Food is good value but a bit hot!

lower case para llevarme todos los sexys

In [6]:
tips.loc[:]["text"] = tips["text"].apply(lambda x: x.lower())
tips

,business_id,text
0,3uLgwr0qeCNMjKenHJwPGQ,avengers time with the ladies.
1,QoezRbYQncpRqyrLH6Iqjg,they have lots of good deserts and tasty cuban...
2,MYoRNLb5chwjQe3c_k37Gg,it's open even when you think it isn't
3,hV-bABTK-glh5wj31ps_Jw,very decent fried chicken
4,_uN0OudeJ3Zl_tf6nxg5ww,appetizers.. platter special for lunch
...,...,...
908910,3lHTewuKFt5IImbXJoFeDQ,disappointed in one of your managers.
908911,OaGf0Dp56ARhQwIDT90w_g,great food and service.
908912,hYnMeAO77RGyTtIzUSKYzQ,love their cubans!!
908913,s2eyoTuJrcP7I_XyjdhUHQ,great pizza great price
908914,_cb1Vg1NIWry8UA0jyuXnQ,food is good value but a bit hot!

In [7]:
tipsSexys = tips[tips["text"].str.contains("sexy")]

In [8]:
tipsSexys

,business_id,text
1655,Bim5pSjkyxxahAkvRRZj1w,a very sexy and competent bartender named brid...
2705,OBO19q1xT5T-fNDxl4S43A,sexy raunchy good time!
6680,AmxMAPbbvkOGV2u2CBG9Ow,"if you like to dance, this is the place. sexy..."
9678,UxzNkaC5944XFQ4Kwiw_ZQ,sexy minis
10136,hxNYDoOeIeb7TBq_qbeg9w,this little boutique is brilliant! so many ch...
...,...,...
886519,5FFLKjQfp0bJhfL-F9xfjQ,scheduled a private lesson for a bachelorette ...
890133,B6VXTY7VZVWQ8cbfPlH-vg,tuesday night bartender soooooooooo sexy!!!
890603,j8NpaEvv4AaweMybeADmGQ,love this place definitely a grown & sexy spo...
900750,UziY1NWbqeJUUEkCzlNxWw,the way jacob yanks the taps is so sexy. 5 sta...
906076,bdXSkYTovwYSv2hpOp5iZQ,hospitality night is now at 9am!! get in with ...

con el df business le agrego los nombres a las 200 tips sexys

In [9]:
grouped = tipsSexys.groupby("business_id").agg({'text':'count'})
grouped  = grouped.rename(columns={'text':'occurrences'})
grouped.head(15)

                        occurrences
business_id
-godNl358x6Hco_sw6DMXQ            1
0JlxuzzDo1Sv89S9ApI9Ng            1
0OJ6J4AoqpxjwQPp159lcg            1
0ufrVvklhrNoENhLraP3_g            1
1817ULc2--fRD1eWnFLg3A            1
1B6S6XDoX1fWnQI0_K1b1Q            1
1T9F7iLDFAYWJvif1RKneg            1
1gIXS-c3kKPevh6mkHzxIg            1
1xuIrC6VBoa_9XB_5eTfAg            1
29sZgoR7VN_3ck3NF5easg            1
2ZqezqDwEO0uuhlX0E54TQ            1
3C0DE-nohNsQU-q7Y6Pmrw            1
3f_RZxPrl_JEcqe27kbxxw            1
3iSRhLUZfZSlLaQw-BzloQ            2
3nYIq4THGUOgQCAF-mkd7w            1

In [10]:
merged = business.merge(grouped,left_on="business_id", right_on="business_id", how="inner")

In [11]:
merged

                business_id                        name  occurrences
0    jiLGdnf42eYftkqfU2ze1w           Saks Fifth Avenue            1
1    RWOqFGfUrdL60jOrtxmcGw                       Osaka            1
2    vDhOjSNfgA4eE1Rj88-XDA                   Safehouse            1
3    m1ohyfs8gcS9X-ZQ3Coj2Q                Chez Yasmine            1
4    4xEJiEQERBvr2jAZQSeF2g                  Mojo Tapas            4
..                      ...                         ...          ...
174  UziY1NWbqeJUUEkCzlNxWw  The Pesky Pelican Brew Pub            1
175  OymuTxYdT9JGi8Per2vTSw                       Mamou            1
176  isRg8RrE1iIv1ks27A1FuA   Wood Fired Pizza Wine Bar            1
177  88ywkVeD9DspLSGC20Ujjg                   260 First            1
178  PWlShgXsJ8Yj3ucD7n8kdA           The Ranstead Room            2

[179 rows x 3 columns]

In [12]:
merged["occurrences"].nlargest(3)

139    5
4      4
63     4
Name: occurrences, dtype: int64

In [13]:
indices = merged["occurrences"].nlargest(3).index
indices

Int64Index([139, 4, 63], dtype='int64')

In [14]:
top3 = merged.filter(items = indices, axis=0)

In [15]:
top3

                business_id                                  name  occurrences
139  IxX6YczoeBpdt78AzDS4GQ               The Butcher And Barkeep            5
4    4xEJiEQERBvr2jAZQSeF2g                            Mojo Tapas            4
63   X9e_btDPux6JGqqw8UF_Pg  Koizi Endless Hibachi & Sushi Eatery            4